## Plan Result (ptlsbox_jenkins)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 3 to add, 12 to change, 3 to destroy.</code></pre>

* Update
  * azurerm_cosmosdb_account.cosmosdb
  * azurerm_key_vault.jenkinskv
  * azurerm_managed_disk.disk
  * azurerm_resource_group.rg
  * azurerm_storage_account.storage_account
  * azurerm_user_assigned_identity.usermi
  * module.jenkins-webhook-relay.azurerm_api_connection.connection
  * module.jenkins-webhook-relay.azurerm_logic_app_integration_account.this
  * module.jenkins-webhook-relay.azurerm_logic_app_workflow.logic_app_workflow
  * module.jenkins-webhook-relay.azurerm_resource_group.azure_resource_group
  * module.jenkins-webhook-relay.azurerm_resource_group_template_deployment.logic_app_deployment
  * module.jenkins-webhook-relay.module.servicebus-namespace.azurerm_servicebus_namespace.servicebus_namespace
* Replace
  * module.jenkins-webhook-relay.module.servicebus-queue.azurerm_servicebus_queue.servicebus_queue
  * module.jenkins-webhook-relay.module.servicebus-queue.azurerm_servicebus_queue_authorization_rule.listen_auth_rule
  * module.jenkins-webhook-relay.module.servicebus-queue.azurerm_servicebus_queue_authorization_rule.send_auth_rule




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_cosmosdb_account.cosmosdb will be updated in-place
  ~ resource "azurerm_cosmosdb_account" "cosmosdb" {
        id                                       = "/subscriptions/64b1c6d6-1481-44ad-b620-d8fe26a2c768/resourceGroups/sds-jenkins-ptlsbox-rg/providers/Microsoft.DocumentDB/databaseAccounts/sds-jenkins-pipeline-metrics-sbox"
        name                                     = "sds-jenkins-pipeline-metrics-sbox"
      ~ tags                                     = {
            "application"  = "core"
            "builtFrom"    = "hmcts/sds-jenkins-infrastructure"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
          + "startupMode"  = "always"
        }
        # (27 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # azurerm_key_vault.jenkinskv will be updated in-place
  ~ resource "azurerm_key_vault" "jenkinskv" {
        id                              = "/subscriptions/64b1c6d6-1481-44ad-b620-d8fe26a2c768/resourceGroups/sds-jenkins-ptlsbox-rg/providers/Microsoft.KeyVault/vaults/ptlsbox"
        name                            = "ptlsbox"
      ~ tags                            = {
            "application"  = "core"
            "builtFrom"    = "hmcts/sds-jenkins-infrastructure"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
          + "startupMode"  = "always"
        }
        # (13 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # azurerm_managed_disk.disk will be updated in-place
  ~ resource "azurerm_managed_disk" "disk" {
        id                            = "/subscriptions/64b1c6d6-1481-44ad-b620-d8fe26a2c768/resourceGroups/disks-ptlsbox-rg/providers/Microsoft.Compute/disks/sds-jenkins-ptlsbox-disk"
        name                          = "sds-jenkins-ptlsbox-disk"
      ~ tags                          = {
            "application"  = "core"
            "builtFrom"    = "hmcts/sds-jenkins-infrastructure"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
          + "startupMode"  = "always"
        }
        # (16 unchanged attributes hidden)
    }

  # azurerm_resource_group.rg will be updated in-place
  ~ resource "azurerm_resource_group" "rg" {
        id       = "/subscriptions/64b1c6d6-1481-44ad-b620-d8fe26a2c768/resourceGroups/sds-jenkins-ptlsbox-rg"
        name     = "sds-jenkins-ptlsbox-rg"
      ~ tags     = {
            "application"  = "core"
            "builtFrom"    = "hmcts/sds-jenkins-infrastructure"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
          + "startupMode"  = "always"
        }
        # (1 unchanged attribute hidden)
    }

  # azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
        id                                = "/subscriptions/64b1c6d6-1481-44ad-b620-d8fe26a2c768/resourceGroups/sds-jenkins-ptlsbox-rg/providers/Microsoft.Storage/storageAccounts/sdsjenkinsafactptlsbox"
        name                              = "sdsjenkinsafactptlsbox"
      ~ tags                              = {
            "application"  = "core"
            "builtFrom"    = "hmcts/sds-jenkins-infrastructure"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
          + "startupMode"  = "always"
        }
        # (37 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # azurerm_user_assigned_identity.usermi will be updated in-place
  ~ resource "azurerm_user_assigned_identity" "usermi" {
        id                  = "/subscriptions/64b1c6d6-1481-44ad-b620-d8fe26a2c768/resourceGroups/managed-identities-ptlsbox-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/jenkins-ptlsbox-mi"
        name                = "jenkins-ptlsbox-mi"
      ~ tags                = {
            "application"  = "core"
            "builtFrom"    = "hmcts/sds-jenkins-infrastructure"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
          + "startupMode"  = "always"
        }
        # (5 unchanged attributes hidden)
    }

  # module.jenkins-webhook-relay.azurerm_api_connection.connection will be updated in-place
  ~ resource "azurerm_api_connection" "connection" {
        id                  = "/subscriptions/64b1c6d6-1481-44ad-b620-d8fe26a2c768/resourceGroups/github-jenkins-sds-ptlsbox-rg/providers/Microsoft.Web/connections/github-sb-jenkins-con"
        name                = "github-sb-jenkins-con"
      ~ tags                = {
            "application"  = "core"
            "builtFrom"    = "hmcts/sds-jenkins-infrastructure"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
          + "startupMode"  = "always"
        }
        # (4 unchanged attributes hidden)
    }

  # module.jenkins-webhook-relay.azurerm_logic_app_integration_account.this will be updated in-place
  ~ resource "azurerm_logic_app_integration_account" "this" {
        id                  = "/subscriptions/64b1c6d6-1481-44ad-b620-d8fe26a2c768/resourceGroups/github-jenkins-sds-ptlsbox-rg/providers/Microsoft.Logic/integrationAccounts/github-jenkins-sds-ptlsbox"
        name                = "github-jenkins-sds-ptlsbox"
      ~ tags                = {
            "application"  = "core"
            "builtFrom"    = "hmcts/sds-jenkins-infrastructure"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
          + "startupMode"  = "always"
        }
        # (3 unchanged attributes hidden)
    }

  # module.jenkins-webhook-relay.azurerm_logic_app_workflow.logic_app_workflow will be updated in-place
  ~ resource "azurerm_logic_app_workflow" "logic_app_workflow" {
        id                               = "/subscriptions/64b1c6d6-1481-44ad-b620-d8fe26a2c768/resourceGroups/github-jenkins-sds-ptlsbox-rg/providers/Microsoft.Logic/workflows/github-jenkins-sds-ptlsbox"
        name                             = "github-jenkins-sds-ptlsbox"
      ~ parameters                       = {
          - "$connections" = jsonencode(
                {
                  - servicebus_1 = {
                      - connectionId   = "/subscriptions/64b1c6d6-1481-44ad-b620-d8fe26a2c768/resourceGroups/github-jenkins-sds-ptlsbox-rg/providers/Microsoft.Web/connections/github-sb-jenkins-con"
                      - connectionName = "servicebus-connection"
                      - id             = "/subscriptions/64b1c6d6-1481-44ad-b620-d8fe26a2c768/providers/Microsoft.Web/locations/uksouth/managedApis/servicebus"
                    }
                }
            ) -> null
        }
      ~ tags                             = {
            "application"  = "core"
            "builtFrom"    = "hmcts/sds-jenkins-infrastructure"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
          + "startupMode"  = "always"
        }
      ~ workflow_parameters              = {
          - "$connections" = jsonencode(
                {
                  - defaultValue = {}
                  - type         = "Object"
                }
            ) -> null
        }
        # (11 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.jenkins-webhook-relay.azurerm_resource_group.azure_resource_group will be updated in-place
  ~ resource "azurerm_resource_group" "azure_resource_group" {
        id       = "/subscriptions/64b1c6d6-1481-44ad-b620-d8fe26a2c768/resourceGroups/github-jenkins-sds-ptlsbox-rg"
        name     = "github-jenkins-sds-ptlsbox-rg"
      ~ tags     = {
            "application"  = "core"
            "builtFrom"    = "hmcts/sds-jenkins-infrastructure"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
          + "startupMode"  = "always"
        }
        # (1 unchanged attribute hidden)
    }

  # module.jenkins-webhook-relay.azurerm_resource_group_template_deployment.logic_app_deployment will be updated in-place
  ~ resource "azurerm_resource_group_template_deployment" "logic_app_deployment" {
        id                  = "/subscriptions/64b1c6d6-1481-44ad-b620-d8fe26a2c768/resourceGroups/github-jenkins-sds-ptlsbox-rg/providers/Microsoft.Resources/deployments/logic-app-deployment"
        name                = "logic-app-deployment"
      ~ parameters_content  = jsonencode(
          ~ {
              ~ commonTags             = {
                  ~ value = "eyJhcHBsaWNhdGlvbiI6ImNvcmUiLCJidWlsdEZyb20iOiJobWN0cy9zZHMtamVua2lucy1pbmZyYXN0cnVjdHVyZSIsImJ1c2luZXNzQXJlYSI6IkNyb3NzLUN1dHRpbmciLCJjcml0aWNhbGl0eSI6IkxvdyIsImVudmlyb25tZW50Ijoic2FuZGJveCIsImV4cGlyZXNBZnRlciI6IjMwMDAtMDEtMDEifQ==" -> "eyJhcHBsaWNhdGlvbiI6ImNvcmUiLCJidWlsdEZyb20iOiJobWN0cy9zZHMtamVua2lucy1pbmZyYXN0cnVjdHVyZSIsImJ1c2luZXNzQXJlYSI6IkNyb3NzLUN1dHRpbmciLCJjcml0aWNhbGl0eSI6IkxvdyIsImVudmlyb25tZW50Ijoic2FuZGJveCIsImV4cGlyZXNBZnRlciI6IjMwMDAtMDEtMDEiLCJzdGFydHVwTW9kZSI6ImFsd2F5cyJ9"
                }
              - rg                     = {
                  - value = ""
                }
              - servicebus_queue       = {
                  - value = "jenkins"
                }
                # (5 unchanged attributes hidden)
            }
        )
      ~ tags                = {
            "application"  = "core"
            "builtFrom"    = "hmcts/sds-jenkins-infrastructure"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
          + "startupMode"  = "always"
        }
        # (4 unchanged attributes hidden)
    }

  # module.jenkins-webhook-relay.module.servicebus-namespace.azurerm_servicebus_namespace.servicebus_namespace will be updated in-place
  ~ resource "azurerm_servicebus_namespace" "servicebus_namespace" {
        id                                  = "/subscriptions/64b1c6d6-1481-44ad-b620-d8fe26a2c768/resourceGroups/github-jenkins-sds-ptlsbox-rg/providers/Microsoft.ServiceBus/namespaces/github-jenkins-sds-ptlsbox"
        name                                = "github-jenkins-sds-ptlsbox"
      ~ tags                                = {
            "application"  = "core"
            "builtFrom"    = "hmcts/sds-jenkins-infrastructure"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
          + "startupMode"  = "always"
        }
        # (13 unchanged attributes hidden)
    }

  # module.jenkins-webhook-relay.module.servicebus-queue.data.azurerm_servicebus_namespace.this will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_servicebus_namespace" "this" {
      + capacity                            = (known after apply)
      + default_primary_connection_string   = (sensitive value)
      + default_primary_key                 = (sensitive value)
      + default_secondary_connection_string = (sensitive value)
      + default_secondary_key               = (sensitive value)
      + endpoint                            = (known after apply)
      + id                                  = (known after apply)
      + location                            = (known after apply)
      + name                                = "github-jenkins-sds-ptlsbox"
      + resource_group_name                 = "github-jenkins-sds-ptlsbox-rg"
      + sku                                 = (known after apply)
      + tags                                = (known after apply)
      + zone_redundant                      = (known after apply)
    }

  # module.jenkins-webhook-relay.module.servicebus-queue.azurerm_servicebus_queue.servicebus_queue must be replaced
-/+ resource "azurerm_servicebus_queue" "servicebus_queue" {
      ~ id                                      = "/subscriptions/64b1c6d6-1481-44ad-b620-d8fe26a2c768/resourceGroups/github-jenkins-sds-ptlsbox-rg/providers/Microsoft.ServiceBus/namespaces/github-jenkins-sds-ptlsbox/queues/jenkins" -> (known after apply)
      ~ max_message_size_in_kilobytes           = 256 -> (known after apply)
        name                                    = "jenkins"
      ~ namespace_id                            = "/subscriptions/64b1c6d6-1481-44ad-b620-d8fe26a2c768/resourceGroups/github-jenkins-sds-ptlsbox-rg/providers/Microsoft.ServiceBus/namespaces/github-jenkins-sds-ptlsbox" # forces replacement -> (known after apply) # forces replacement
        # (13 unchanged attributes hidden)
    }

  # module.jenkins-webhook-relay.module.servicebus-queue.azurerm_servicebus_queue_authorization_rule.listen_auth_rule must be replaced
-/+ resource "azurerm_servicebus_queue_authorization_rule" "listen_auth_rule" {
      ~ id                                = "/subscriptions/64b1c6d6-1481-44ad-b620-d8fe26a2c768/resourceGroups/github-jenkins-sds-ptlsbox-rg/providers/Microsoft.ServiceBus/namespaces/github-jenkins-sds-ptlsbox/queues/jenkins/authorizationRules/ListenSharedAccessKey" -> (known after apply)
        name                              = "ListenSharedAccessKey"
      ~ primary_connection_string         = (sensitive value)
      + primary_connection_string_alias   = (sensitive value)
      ~ primary_key                       = (sensitive value)
      ~ queue_id                          = "/subscriptions/64b1c6d6-1481-44ad-b620-d8fe26a2c768/resourceGroups/github-jenkins-sds-ptlsbox-rg/providers/Microsoft.ServiceBus/namespaces/github-jenkins-sds-ptlsbox/queues/jenkins" # forces replacement -> (known after apply) # forces replacement
      ~ secondary_connection_string       = (sensitive value)
      + secondary_connection_string_alias = (sensitive value)
      ~ secondary_key                     = (sensitive value)
        # (3 unchanged attributes hidden)
    }

  # module.jenkins-webhook-relay.module.servicebus-queue.azurerm_servicebus_queue_authorization_rule.send_auth_rule must be replaced
-/+ resource "azurerm_servicebus_queue_authorization_rule" "send_auth_rule" {
      ~ id                                = "/subscriptions/64b1c6d6-1481-44ad-b620-d8fe26a2c768/resourceGroups/github-jenkins-sds-ptlsbox-rg/providers/Microsoft.ServiceBus/namespaces/github-jenkins-sds-ptlsbox/queues/jenkins/authorizationRules/SendSharedAccessKey" -> (known after apply)
        name                              = "SendSharedAccessKey"
      ~ primary_connection_string         = (sensitive value)
      + primary_connection_string_alias   = (sensitive value)
      ~ primary_key                       = (sensitive value)
      ~ queue_id                          = "/subscriptions/64b1c6d6-1481-44ad-b620-d8fe26a2c768/resourceGroups/github-jenkins-sds-ptlsbox-rg/providers/Microsoft.ServiceBus/namespaces/github-jenkins-sds-ptlsbox/queues/jenkins" # forces replacement -> (known after apply) # forces replacement
      ~ secondary_connection_string       = (sensitive value)
      + secondary_connection_string_alias = (sensitive value)
      ~ secondary_key                     = (sensitive value)
        # (3 unchanged attributes hidden)
    }

Plan: 3 to add, 12 to change, 3 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":79,"Program":"tfcmt","SHA1":"","Target":"ptlsbox_jenkins","Vars":{}} -->